In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("hiring.csv")

In [3]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [4]:
df['test_score']=df['test_score'].fillna(0)

In [5]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         0.0                7   72000
7     eleven         7.0                8   80000

In [20]:
#can also use word2number library
def word2num(x):
    words={'zero':0,'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11}
    return words[x]

In [21]:
df=df.fillna('zero')

In [22]:
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         0.0                7   72000
7     eleven         7.0                8   80000

In [23]:
word2num('two')

2

In [24]:
df['experience']=df['experience'].apply(lambda x:word2num(x))

In [25]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         0.0                7   72000
7          11         7.0                8   80000

In [27]:
x=df.drop('salary',axis=1)

In [28]:
y=df['salary']

In [29]:
from sklearn.model_selection import train_test_split

In [30]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [31]:
from sklearn.linear_model import LinearRegression

In [32]:
model=LinearRegression()

In [33]:
model.fit(x_train,y_train)

LinearRegression()

In [34]:
model.score(x_test,y_test)

0.6967367349083693

In [37]:
model.predict([[10,8,7]])

c:\users\avi\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([82133.71269057])

In [38]:
import pickle

In [39]:
with open('model_pkl','wb') as f:
    pickle.dump(model,f)